RT-Thread/rt-thread/bsp/maxim/libraries/MAX32660PeriphDriver/CMSIS/Device/Maxim/MAX32660/Include/spimss_regs.h
 #define MXC_F_SPIMSS_CTRL_BIRQ_POS                     5 /**< CTRL_BIRQ Position */
 #define MXC_F_SPIMSS_CTRL_BIRQ                         ((uint32_t)(0x1UL << MXC_F_SPIMSS_CTRL_BIRQ_POS)) /**< CTRL_BIRQ Mask */
 #define MXC_V_SPIMSS_CTRL_BIRQ_DISABLE                 ((uint32_t)0x0UL) /**< CTRL_BIRQ_DISABLE Value */
 #define MXC_S_SPIMSS_CTRL_BIRQ_DISABLE                 (MXC_V_SPIMSS_CTRL_BIRQ_DISABLE << MXC_F_SPIMSS_CTRL_BIRQ_POS) /**< CTRL_BIRQ_DISABLE Setting */
 #define MXC_V_SPIMSS_CTRL_BIRQ_ENABLE                  ((uint32_t)0x1UL) /**< CTRL_BIRQ_ENABLE Value */
 #define MXC_S_SPIMSS_CTRL_BIRQ_ENABLE                  (MXC_V_SPIMSS_CTRL_BIRQ_ENABLE << MXC_F_SPIMSS_CTRL_BIRQ_POS) /**< CTRL_BIRQ_ENABLE Setting */

 #define MXC_F_SPIMSS_CTRL_STR_POS                      6 /**< CTRL_STR Position */
 #define MXC_F_SPIMSS_CTRL_STR                          ((uint32_t)(0x1UL << MXC_F_SPIMSS_CTRL_STR_POS)) /**< CTRL_STR Mask */
 #define MXC_V_SPIMSS_CTRL_STR_COMPLETE                 ((uint32_t)0x0UL) /**< CTRL_STR_COMPLETE Value */
 #define MXC_S_SPIMSS_CTRL_STR_COMPLETE                 (MXC_V_SPIMSS_CTRL_STR_COMPLETE << MXC_F_SPIMSS_CTRL_STR_POS) /**< CTRL_STR_COMPLETE Setting */
 #define MXC_V_SPIMSS_CTRL_STR_START                    ((uint32_t)0x1UL) /**< CTRL_STR_START Value */
 #define MXC_S_SPIMSS_CTRL_STR_START                    (MXC_V_SPIMSS_CTRL_STR_START << MXC_F_SPIMSS_CTRL_STR_POS) /**< CTRL_STR_START Setting */

 #define MXC_F_SPIMSS_CTRL_IRQE_POS                     7 /**< CTRL_IRQE Position */
 #define MXC_F_SPIMSS_CTRL_IRQE                         ((uint32_t)(0x1UL << MXC_F_SPIMSS_CTRL_IRQE_POS)) /**< CTRL_IRQE Mask */
 #define MXC_V_SPIMSS_CTRL_IRQE_DISABLE                 ((uint32_t)0x0UL) /**< CTRL_IRQE_DISABLE Value */
 #define MXC_S_SPIMSS_CTRL_IRQE_DISABLE                 (MXC_V_SPIMSS_CTRL_IRQE_DISABLE << MXC_F_SPIMSS_CTRL_IRQE_POS) /**< CTRL_IRQE_DISABLE Setting */
 #define MXC_V_SPIMSS_CTRL_IRQE_ENABLE                  ((uint32_t)0x1UL) /**< CTRL_IRQE_ENABLE Value */
 #define MXC_S_SPIMSS_CTRL_IRQE_ENABLE                  (MXC_V_SPIMSS_CTRL_IRQE_ENABLE << MXC_F_SPIMSS_CTRL_IRQE_POS) /**< CTRL_IRQE_ENABLE Setting */

/**@} end of group SPIMSS_CTRL_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_STATUS SPIMSS_STATUS
 * @brief    SPI Status Register.
 * @{
 */
 #define MXC_F_SPIMSS_STATUS_SLAS_POS                   0 /**< STATUS_SLAS Position */
 #define MXC_F_SPIMSS_STATUS_SLAS                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_STATUS_SLAS_POS)) /**< STATUS_SLAS Mask */
 #define MXC_V_SPIMSS_STATUS_SLAS_SELECTED              ((uint32_t)0x0UL) /**< STATUS_SLAS_SELECTED Value */
 #define MXC_S_SPIMSS_STATUS_SLAS_SELECTED              (MXC_V_SPIMSS_STATUS_SLAS_SELECTED << MXC_F_SPIMSS_STATUS_SLAS_POS) /**< STATUS_SLAS_SELECTED Setting */
 #define MXC_V_SPIMSS_STATUS_SLAS_NOTSELECTED           ((uint32_t)0x1UL) /**< STATUS_SLAS_NOTSELECTED Value */
 #define MXC_S_SPIMSS_STATUS_SLAS_NOTSELECTED           (MXC_V_SPIMSS_STATUS_SLAS_NOTSELECTED << MXC_F_SPIMSS_STATUS_SLAS_POS) /**< STATUS_SLAS_NOTSELECTED Setting */

 #define MXC_F_SPIMSS_STATUS_TXST_POS                   1 /**< STATUS_TXST Position */
 #define MXC_F_SPIMSS_STATUS_TXST                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_STATUS_TXST_POS)) /**< STATUS_TXST Mask */
 #define MXC_V_SPIMSS_STATUS_TXST_IDLE                  ((uint32_t)0x0UL) /**< STATUS_TXST_IDLE Value */
 #define MXC_S_SPIMSS_STATUS_TXST_IDLE                  (MXC_V_SPIMSS_STATUS_TXST_IDLE << MXC_F_SPIMSS_STATUS_TXST_POS) /**< STATUS_TXST_IDLE Setting */
 #define MXC_V_SPIMSS_STATUS_TXST_BUSY                  ((uint32_t)0x1UL) /**< STATUS_TXST_BUSY Value */
 #define MXC_S_SPIMSS_STATUS_TXST_BUSY                  (MXC_V_SPIMSS_STATUS_TXST_BUSY << MXC_F_SPIMSS_STATUS_TXST_POS) /**< STATUS_TXST_BUSY Setting */

 #define MXC_F_SPIMSS_STATUS_TUND_POS                   2 /**< STATUS_TUND Position */
 #define MXC_F_SPIMSS_STATUS_TUND                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_STATUS_TUND_POS)) /**< STATUS_TUND Mask */
 #define MXC_V_SPIMSS_STATUS_TUND_NOEVENT               ((uint32_t)0x0UL) /**< STATUS_TUND_NOEVENT Value */
 #define MXC_S_SPIMSS_STATUS_TUND_NOEVENT               (MXC_V_SPIMSS_STATUS_TUND_NOEVENT << MXC_F_SPIMSS_STATUS_TUND_POS) /**< STATUS_TUND_NOEVENT Setting */
 #define MXC_V_SPIMSS_STATUS_TUND_OCCURRED              ((uint32_t)0x1UL) /**< STATUS_TUND_OCCURRED Value */
 #define MXC_S_SPIMSS_STATUS_TUND_OCCURRED              (MXC_V_SPIMSS_STATUS_TUND_OCCURRED << MXC_F_SPIMSS_STATUS_TUND_POS) /**< STATUS_TUND_OCCURRED Setting */

 #define MXC_F_SPIMSS_STATUS_ROVR_POS                   3 /**< STATUS_ROVR Position */
 #define MXC_F_SPIMSS_STATUS_ROVR                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_STATUS_ROVR_POS)) /**< STATUS_ROVR Mask */
 #define MXC_V_SPIMSS_STATUS_ROVR_NOEVENT               ((uint32_t)0x0UL) /**< STATUS_ROVR_NOEVENT Value */
 #define MXC_S_SPIMSS_STATUS_ROVR_NOEVENT               (MXC_V_SPIMSS_STATUS_ROVR_NOEVENT << MXC_F_SPIMSS_STATUS_ROVR_POS) /**< STATUS_ROVR_NOEVENT Setting */
 #define MXC_V_SPIMSS_STATUS_ROVR_OCCURRED              ((uint32_t)0x1UL) /**< STATUS_ROVR_OCCURRED Value */
 #define MXC_S_SPIMSS_STATUS_ROVR_OCCURRED              (MXC_V_SPIMSS_STATUS_ROVR_OCCURRED << MXC_F_SPIMSS_STATUS_ROVR_POS) /**< STATUS_ROVR_OCCURRED Setting */

 #define MXC_F_SPIMSS_STATUS_ABT_POS                    4 /**< STATUS_ABT Position */
 #define MXC_F_SPIMSS_STATUS_ABT                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_STATUS_ABT_POS)) /**< STATUS_ABT Mask */
 #define MXC_V_SPIMSS_STATUS_ABT_NOEVENT                ((uint32_t)0x0UL) /**< STATUS_ABT_NOEVENT Value */
 #define MXC_S_SPIMSS_STATUS_ABT_NOEVENT                (MXC_V_SPIMSS_STATUS_ABT_NOEVENT << MXC_F_SPIMSS_STATUS_ABT_POS) /**< STATUS_ABT_NOEVENT Setting */
 #define MXC_V_SPIMSS_STATUS_ABT_OCCURRED               ((uint32_t)0x1UL) /**< STATUS_ABT_OCCURRED Value */
 #define MXC_S_SPIMSS_STATUS_ABT_OCCURRED               (MXC_V_SPIMSS_STATUS_ABT_OCCURRED << MXC_F_SPIMSS_STATUS_ABT_POS) /**< STATUS_ABT_OCCURRED Setting */

 #define MXC_F_SPIMSS_STATUS_COL_POS                    5 /**< STATUS_COL Position */
 #define MXC_F_SPIMSS_STATUS_COL                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_STATUS_COL_POS)) /**< STATUS_COL Mask */
 #define MXC_V_SPIMSS_STATUS_COL_NOEVENT                ((uint32_t)0x0UL) /**< STATUS_COL_NOEVENT Value */
 #define MXC_S_SPIMSS_STATUS_COL_NOEVENT                (MXC_V_SPIMSS_STATUS_COL_NOEVENT << MXC_F_SPIMSS_STATUS_COL_POS) /**< STATUS_COL_NOEVENT Setting */
 #define MXC_V_SPIMSS_STATUS_COL_OCCURRED               ((uint32_t)0x1UL) /**< STATUS_COL_OCCURRED Value */
 #define MXC_S_SPIMSS_STATUS_COL_OCCURRED               (MXC_V_SPIMSS_STATUS_COL_OCCURRED << MXC_F_SPIMSS_STATUS_COL_POS) /**< STATUS_COL_OCCURRED Setting */

