RT-Thread/rt-thread/bsp/maxim/libraries/MAX32660PeriphDriver/CMSIS/Device/Maxim/MAX32660/Include/spimss_regs.h
 #define MXC_F_SPIMSS_STATUS_TOVR_POS                   6 /**< STATUS_TOVR Position */
 #define MXC_F_SPIMSS_STATUS_TOVR                       ((uint32_t)(0x1UL << MXC_F_SPIMSS_STATUS_TOVR_POS)) /**< STATUS_TOVR Mask */
 #define MXC_V_SPIMSS_STATUS_TOVR_NOEVENT               ((uint32_t)0x0UL) /**< STATUS_TOVR_NOEVENT Value */
 #define MXC_S_SPIMSS_STATUS_TOVR_NOEVENT               (MXC_V_SPIMSS_STATUS_TOVR_NOEVENT << MXC_F_SPIMSS_STATUS_TOVR_POS) /**< STATUS_TOVR_NOEVENT Setting */
 #define MXC_V_SPIMSS_STATUS_TOVR_OCCURRED              ((uint32_t)0x1UL) /**< STATUS_TOVR_OCCURRED Value */
 #define MXC_S_SPIMSS_STATUS_TOVR_OCCURRED              (MXC_V_SPIMSS_STATUS_TOVR_OCCURRED << MXC_F_SPIMSS_STATUS_TOVR_POS) /**< STATUS_TOVR_OCCURRED Setting */

 #define MXC_F_SPIMSS_STATUS_IRQ_POS                    7 /**< STATUS_IRQ Position */
 #define MXC_F_SPIMSS_STATUS_IRQ                        ((uint32_t)(0x1UL << MXC_F_SPIMSS_STATUS_IRQ_POS)) /**< STATUS_IRQ Mask */
 #define MXC_V_SPIMSS_STATUS_IRQ_INACTIVE               ((uint32_t)0x0UL) /**< STATUS_IRQ_INACTIVE Value */
 #define MXC_S_SPIMSS_STATUS_IRQ_INACTIVE               (MXC_V_SPIMSS_STATUS_IRQ_INACTIVE << MXC_F_SPIMSS_STATUS_IRQ_POS) /**< STATUS_IRQ_INACTIVE Setting */
 #define MXC_V_SPIMSS_STATUS_IRQ_PENDING                ((uint32_t)0x1UL) /**< STATUS_IRQ_PENDING Value */
 #define MXC_S_SPIMSS_STATUS_IRQ_PENDING                (MXC_V_SPIMSS_STATUS_IRQ_PENDING << MXC_F_SPIMSS_STATUS_IRQ_POS) /**< STATUS_IRQ_PENDING Setting */

/**@} end of group SPIMSS_STATUS_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_MOD SPIMSS_MOD
 * @brief    SPI Mode Register.
 * @{
 */
 #define MXC_F_SPIMSS_MOD_SSV_POS                       0 /**< MOD_SSV Position */
 #define MXC_F_SPIMSS_MOD_SSV                           ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_SSV_POS)) /**< MOD_SSV Mask */
 #define MXC_V_SPIMSS_MOD_SSV_LO                        ((uint32_t)0x0UL) /**< MOD_SSV_LO Value */
 #define MXC_S_SPIMSS_MOD_SSV_LO                        (MXC_V_SPIMSS_MOD_SSV_LO << MXC_F_SPIMSS_MOD_SSV_POS) /**< MOD_SSV_LO Setting */
 #define MXC_V_SPIMSS_MOD_SSV_HI                        ((uint32_t)0x1UL) /**< MOD_SSV_HI Value */
 #define MXC_S_SPIMSS_MOD_SSV_HI                        (MXC_V_SPIMSS_MOD_SSV_HI << MXC_F_SPIMSS_MOD_SSV_POS) /**< MOD_SSV_HI Setting */

 #define MXC_F_SPIMSS_MOD_SSIO_POS                      1 /**< MOD_SSIO Position */
 #define MXC_F_SPIMSS_MOD_SSIO                          ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_SSIO_POS)) /**< MOD_SSIO Mask */
 #define MXC_V_SPIMSS_MOD_SSIO_INPUT                    ((uint32_t)0x0UL) /**< MOD_SSIO_INPUT Value */
 #define MXC_S_SPIMSS_MOD_SSIO_INPUT                    (MXC_V_SPIMSS_MOD_SSIO_INPUT << MXC_F_SPIMSS_MOD_SSIO_POS) /**< MOD_SSIO_INPUT Setting */
 #define MXC_V_SPIMSS_MOD_SSIO_OUTPUT                   ((uint32_t)0x1UL) /**< MOD_SSIO_OUTPUT Value */
 #define MXC_S_SPIMSS_MOD_SSIO_OUTPUT                   (MXC_V_SPIMSS_MOD_SSIO_OUTPUT << MXC_F_SPIMSS_MOD_SSIO_POS) /**< MOD_SSIO_OUTPUT Setting */

 #define MXC_F_SPIMSS_MOD_NUMBITS_POS                   2 /**< MOD_NUMBITS Position */
 #define MXC_F_SPIMSS_MOD_NUMBITS                       ((uint32_t)(0xFUL << MXC_F_SPIMSS_MOD_NUMBITS_POS)) /**< MOD_NUMBITS Mask */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS16                ((uint32_t)0x0UL) /**< MOD_NUMBITS_BITS16 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS16                (MXC_V_SPIMSS_MOD_NUMBITS_BITS16 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS16 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS1                 ((uint32_t)0x1UL) /**< MOD_NUMBITS_BITS1 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS1                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS1 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS1 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS2                 ((uint32_t)0x2UL) /**< MOD_NUMBITS_BITS2 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS2                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS2 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS2 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS3                 ((uint32_t)0x3UL) /**< MOD_NUMBITS_BITS3 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS3                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS3 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS3 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS4                 ((uint32_t)0x4UL) /**< MOD_NUMBITS_BITS4 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS4                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS4 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS4 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS5                 ((uint32_t)0x5UL) /**< MOD_NUMBITS_BITS5 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS5                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS5 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS5 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS6                 ((uint32_t)0x6UL) /**< MOD_NUMBITS_BITS6 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS6                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS6 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS6 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS7                 ((uint32_t)0x7UL) /**< MOD_NUMBITS_BITS7 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS7                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS7 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS7 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS8                 ((uint32_t)0x8UL) /**< MOD_NUMBITS_BITS8 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS8                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS8 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS8 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS9                 ((uint32_t)0x9UL) /**< MOD_NUMBITS_BITS9 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS9                 (MXC_V_SPIMSS_MOD_NUMBITS_BITS9 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS9 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS10                ((uint32_t)0xAUL) /**< MOD_NUMBITS_BITS10 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS10                (MXC_V_SPIMSS_MOD_NUMBITS_BITS10 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS10 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS11                ((uint32_t)0xBUL) /**< MOD_NUMBITS_BITS11 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS11                (MXC_V_SPIMSS_MOD_NUMBITS_BITS11 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS11 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS12                ((uint32_t)0xCUL) /**< MOD_NUMBITS_BITS12 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS12                (MXC_V_SPIMSS_MOD_NUMBITS_BITS12 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS12 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS13                ((uint32_t)0xDUL) /**< MOD_NUMBITS_BITS13 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS13                (MXC_V_SPIMSS_MOD_NUMBITS_BITS13 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS13 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS14                ((uint32_t)0xEUL) /**< MOD_NUMBITS_BITS14 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS14                (MXC_V_SPIMSS_MOD_NUMBITS_BITS14 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS14 Setting */
 #define MXC_V_SPIMSS_MOD_NUMBITS_BITS15                ((uint32_t)0xFUL) /**< MOD_NUMBITS_BITS15 Value */
 #define MXC_S_SPIMSS_MOD_NUMBITS_BITS15                (MXC_V_SPIMSS_MOD_NUMBITS_BITS15 << MXC_F_SPIMSS_MOD_NUMBITS_POS) /**< MOD_NUMBITS_BITS15 Setting */

 #define MXC_F_SPIMSS_MOD_TX_LJ_POS                     7 /**< MOD_TX_LJ Position */
 #define MXC_F_SPIMSS_MOD_TX_LJ                         ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_TX_LJ_POS)) /**< MOD_TX_LJ Mask */
 #define MXC_V_SPIMSS_MOD_TX_LJ_DISABLE                 ((uint32_t)0x0UL) /**< MOD_TX_LJ_DISABLE Value */
 #define MXC_S_SPIMSS_MOD_TX_LJ_DISABLE                 (MXC_V_SPIMSS_MOD_TX_LJ_DISABLE << MXC_F_SPIMSS_MOD_TX_LJ_POS) /**< MOD_TX_LJ_DISABLE Setting */
 #define MXC_V_SPIMSS_MOD_TX_LJ_ENABLE                  ((uint32_t)0x1UL) /**< MOD_TX_LJ_ENABLE Value */
 #define MXC_S_SPIMSS_MOD_TX_LJ_ENABLE                  (MXC_V_SPIMSS_MOD_TX_LJ_ENABLE << MXC_F_SPIMSS_MOD_TX_LJ_POS) /**< MOD_TX_LJ_ENABLE Setting */

 #define MXC_F_SPIMSS_MOD_SSL1_POS                      8 /**< MOD_SSL1 Position */
 #define MXC_F_SPIMSS_MOD_SSL1                          ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_SSL1_POS)) /**< MOD_SSL1 Mask */
 #define MXC_V_SPIMSS_MOD_SSL1_HI                       ((uint32_t)0x0UL) /**< MOD_SSL1_HI Value */
 #define MXC_S_SPIMSS_MOD_SSL1_HI                       (MXC_V_SPIMSS_MOD_SSL1_HI << MXC_F_SPIMSS_MOD_SSL1_POS) /**< MOD_SSL1_HI Setting */
 #define MXC_V_SPIMSS_MOD_SSL1_LO                       ((uint32_t)0x1UL) /**< MOD_SSL1_LO Value */
 #define MXC_S_SPIMSS_MOD_SSL1_LO                       (MXC_V_SPIMSS_MOD_SSL1_LO << MXC_F_SPIMSS_MOD_SSL1_POS) /**< MOD_SSL1_LO Setting */

 #define MXC_F_SPIMSS_MOD_SSL2_POS                      9 /**< MOD_SSL2 Position */
 #define MXC_F_SPIMSS_MOD_SSL2                          ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_SSL2_POS)) /**< MOD_SSL2 Mask */
 #define MXC_V_SPIMSS_MOD_SSL2_HI                       ((uint32_t)0x0UL) /**< MOD_SSL2_HI Value */
 #define MXC_S_SPIMSS_MOD_SSL2_HI                       (MXC_V_SPIMSS_MOD_SSL2_HI << MXC_F_SPIMSS_MOD_SSL2_POS) /**< MOD_SSL2_HI Setting */
 #define MXC_V_SPIMSS_MOD_SSL2_LO                       ((uint32_t)0x1UL) /**< MOD_SSL2_LO Value */
 #define MXC_S_SPIMSS_MOD_SSL2_LO                       (MXC_V_SPIMSS_MOD_SSL2_LO << MXC_F_SPIMSS_MOD_SSL2_POS) /**< MOD_SSL2_LO Setting */

 #define MXC_F_SPIMSS_MOD_SSL3_POS                      10 /**< MOD_SSL3 Position */
 #define MXC_F_SPIMSS_MOD_SSL3                          ((uint32_t)(0x1UL << MXC_F_SPIMSS_MOD_SSL3_POS)) /**< MOD_SSL3 Mask */
 #define MXC_V_SPIMSS_MOD_SSL3_HI                       ((uint32_t)0x0UL) /**< MOD_SSL3_HI Value */
 #define MXC_S_SPIMSS_MOD_SSL3_HI                       (MXC_V_SPIMSS_MOD_SSL3_HI << MXC_F_SPIMSS_MOD_SSL3_POS) /**< MOD_SSL3_HI Setting */
 #define MXC_V_SPIMSS_MOD_SSL3_LO                       ((uint32_t)0x1UL) /**< MOD_SSL3_LO Value */
 #define MXC_S_SPIMSS_MOD_SSL3_LO                       (MXC_V_SPIMSS_MOD_SSL3_LO << MXC_F_SPIMSS_MOD_SSL3_POS) /**< MOD_SSL3_LO Setting */

/**@} end of group SPIMSS_MOD_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_BRG SPIMSS_BRG
 * @brief    Baud Rate Reload Value. The SPI Baud Rate register is a 16-bit reload value for
 *           the SPI Baud Rate Generator. The reload value must be greater than or equal to
 *           0002H for proper SPI operation (maximum baud rate is PCLK frequency divided by
 *           4).
 * @{
 */
 #define MXC_F_SPIMSS_BRG_BRG_POS                       0 /**< BRG_BRG Position */
 #define MXC_F_SPIMSS_BRG_BRG                           ((uint32_t)(0xFFFFUL << MXC_F_SPIMSS_BRG_BRG_POS)) /**< BRG_BRG Mask */

/**@} end of group SPIMSS_BRG_Register */

/**
 * @ingroup  spimss_registers
 * @defgroup SPIMSS_DMA SPIMSS_DMA
 * @brief    SPI DMA Register.
 * @{
 */
 #define MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS             0 /**< DMA_TX_FIFO_LEVEL Position */
 #define MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL                 ((uint32_t)(0x7UL << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS)) /**< DMA_TX_FIFO_LEVEL Mask */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRY1          ((uint32_t)0x0UL) /**< DMA_TX_FIFO_LEVEL_ENTRY1 Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRY1          (MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRY1 << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS) /**< DMA_TX_FIFO_LEVEL_ENTRY1 Setting */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES2        ((uint32_t)0x1UL) /**< DMA_TX_FIFO_LEVEL_ENTRIES2 Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES2        (MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES2 << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS) /**< DMA_TX_FIFO_LEVEL_ENTRIES2 Setting */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES3        ((uint32_t)0x2UL) /**< DMA_TX_FIFO_LEVEL_ENTRIES3 Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES3        (MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES3 << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS) /**< DMA_TX_FIFO_LEVEL_ENTRIES3 Setting */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES4        ((uint32_t)0x3UL) /**< DMA_TX_FIFO_LEVEL_ENTRIES4 Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES4        (MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES4 << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS) /**< DMA_TX_FIFO_LEVEL_ENTRIES4 Setting */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES5        ((uint32_t)0x4UL) /**< DMA_TX_FIFO_LEVEL_ENTRIES5 Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES5        (MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES5 << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS) /**< DMA_TX_FIFO_LEVEL_ENTRIES5 Setting */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES6        ((uint32_t)0x5UL) /**< DMA_TX_FIFO_LEVEL_ENTRIES6 Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES6        (MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES6 << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS) /**< DMA_TX_FIFO_LEVEL_ENTRIES6 Setting */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES7        ((uint32_t)0x6UL) /**< DMA_TX_FIFO_LEVEL_ENTRIES7 Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES7        (MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES7 << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS) /**< DMA_TX_FIFO_LEVEL_ENTRIES7 Setting */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES8        ((uint32_t)0x7UL) /**< DMA_TX_FIFO_LEVEL_ENTRIES8 Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES8        (MXC_V_SPIMSS_DMA_TX_FIFO_LEVEL_ENTRIES8 << MXC_F_SPIMSS_DMA_TX_FIFO_LEVEL_POS) /**< DMA_TX_FIFO_LEVEL_ENTRIES8 Setting */

 #define MXC_F_SPIMSS_DMA_TX_FIFO_CLEAR_POS             4 /**< DMA_TX_FIFO_CLEAR Position */
 #define MXC_F_SPIMSS_DMA_TX_FIFO_CLEAR                 ((uint32_t)(0x1UL << MXC_F_SPIMSS_DMA_TX_FIFO_CLEAR_POS)) /**< DMA_TX_FIFO_CLEAR Mask */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_CLEAR_COMPLETE        ((uint32_t)0x0UL) /**< DMA_TX_FIFO_CLEAR_COMPLETE Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_CLEAR_COMPLETE        (MXC_V_SPIMSS_DMA_TX_FIFO_CLEAR_COMPLETE << MXC_F_SPIMSS_DMA_TX_FIFO_CLEAR_POS) /**< DMA_TX_FIFO_CLEAR_COMPLETE Setting */
 #define MXC_V_SPIMSS_DMA_TX_FIFO_CLEAR_START           ((uint32_t)0x1UL) /**< DMA_TX_FIFO_CLEAR_START Value */
 #define MXC_S_SPIMSS_DMA_TX_FIFO_CLEAR_START           (MXC_V_SPIMSS_DMA_TX_FIFO_CLEAR_START << MXC_F_SPIMSS_DMA_TX_FIFO_CLEAR_POS) /**< DMA_TX_FIFO_CLEAR_START Setting */

